Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །རོ་ཐམས་ཅད་ཀྱི་ཞལ་དུ་བཅུག་ན། བདུད་རྩིའི་རོ་དང་འདྲ་བར་འགྱུར་ཏེ།
en: When all tastes are introduced to the mouth they become like the taste of nectar.

source: དེ་ནི་མཚན་གྱི་ལས་སོ།
en: That is the karma of the major mark.

source: །སྔོན་གྱི་ལས་དང་མཐུན་པ་ནི་གོ་སླའོ།
en: How it is similar to the earlier karma is easy to understand. “

source: །ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་ཞེས་བྱ་བ་འདི་ལ་ཁ་ཅིག་ན་རེ་ནྱ་གྲོ་ཞེས་བྱ་བ་ནི་ངན་པ་སྟེ།
en: A build like an Indian fig tree”— some say nya gro means beneath.

source: རོ་སྨད་ལ་བྱའོ།
en: Take this as the lower part of the body.

source: །རོ་དྷ་ཞེས་བྱ་བ་ནི་རོ་སྟོད་དོ།
en: Take the ro dha as the upper part of the body.

source: །ཆུ་ཞེང་གབ་པ་ཞེས་བྱ་བ་ནི་མཐུན་པ་ལ་བྱ་སྟེ།
en: Their build is the same.

source: གང་གི་སྐུ་ལྟེ་བ་ནས་བཟུང་སྟེ། རོ་སྟོད་དང་རོ་སྨད་ཚད་མཉམ་པར་གྱུར་པ་དེ་ལ་ནྱ་གྲོ་དྷ་ལྟར་ཆུང་ཞེང་གབ་པ་ཞེས་བྱ་བའོ་ཞེས་ཟེར་རོ།
en: So, when the upper part and the lower part of their body, starting from the waist, are equal in size it is said that they have “a build like an Indian fig tree.”

source: །གཞན་དག་ན་རེ་ནྱ་གྲོ་ཞེས་བྱ་བ་ནི་སྐུའི་དབུ་ནས་ཞབས་ཀྱི་བར་གྱི་ཚད་ལ་བྱའོ། །རོ་དྷ་ནི་ཞེང་ལ་བྱའོ། །ཆུ་ཞེང་གབ་པ་ཞེས་བྱ་བ་ནི་འདོམ་ལ་བྱ་སྟེ།
en: Others say take the nya gro to be from the top of the head down to the feet; take the ro dha as the width; and take the build as the two outstretched arms.

source: དེ་ལ་གང་གི་སྐུའི་ཆུ་ཞེང་འདོམ་དང་མཉམ་པར་གྱུར་པ་དེ་ལ་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་ཅེས་བྱའོ་ཟེར་རོ།
en: So there, when the height and width of their body is the same length of their two outstretched arms, it is said that they have “a build like an Indian fig tree.”

source: །གཞན་དག་ནི་ཤིང་ནྱ་གྲོ་དྷ་ཞེས་བྱ་བ་སྡོང་པོ་དང་ཡལ་ག་རྣམས་ཆུ་ཞེང་མཉམ་པ་ཞིག་ཡོད་དེ།
en: Some say the trunk and branches of an Indian fig tree are equal in height and width.

source: དེ་དང་འདྲ་བར་སྐྱེས་བུ་ཆེན་པོ་རྣམས་ཀྱི་སྐུ་ཐམས་ཅད་ཀྱང་འདོམ་གྱི་ཚད་དང་མཉམ་པ་ནི་ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་ཞེས་བྱའོ་ཞེས་སྨྲའོ།
en: All the bodies of great persons are like that, the same in being the size of two extended arms. “[

source: །དབུ་གཙུག་ཏོར་དང་ལྡན་པ་ཞེས་བྱ་བ་ནི་དབུ་ཟེའུ་ཀ་བཅིངས་པ་དང་འདྲ་བ་ལ་བྱ་སྟེ།
en: They] have an uṣṇīṣa on the top of their head”— take this as a head like a bound turban.

source: གཞན་དག་གི་མགོ་ནི་ཡོངས་སུ་མ་རྒྱས་ཤིང་མཐོ་དམན་ཅན་ལ།
en: It is explained that the heads of others are not fully developed, are elongated or squashed and are not symmetrical.

source: མི་མཉམ་པ་དག་ཡོད་ཀྱི། སྐྱེས་བུ་ཆེན་པོ་རྣམས་ཀྱི་དབུ་ནི་གཙུག་ཏོར་བཞིན་དུ་སྙོམས་ཤིང་ཡོངས་སུ་ཟླུམ་པ་དང་། ཡོངས་སུ་རྫོགས་ཤིང་དབྱིབས་ལེགས་པ་དང་། ལེགས་པར་རྒྱས་པ་ཡིན་ནོ་ཞེས་འཆད་དོ།
en: The heads of great persons are arranged evenly like a turban, spherical, completed, well shaped, and well developed.

source: །གཞན་དག་ན་རེ་མཚན་འདི་ནི་འཕྲལ་བའི་དབྱེས་ཡོངས་སུ་རྒྱས་པ་བསྟན་པའི་ཕྱིར་ཏེ།
en: Others say this major sign is to teach that the forehead is fully developed in size.

source: སྐྱེས་བུ་ཆེན་པོ་རྣམས་ཀྱི་འཕྲལ་བ་ནི་རྣ་བ་གཡས་པའི་གོང་ནས་རྣ་བ་གཡོན་པའི་གོང་གི་བར་དུ་ཤའི་དབྱིབས་ལེགས་པ། འཕྲལ་བའི་དབྱེས་ཡོངས་སུ་རྫོགས་པ། རྒྱལ་པོ་གསེར་གྱི་གཙུག་ཏོར་བཅིངས་པ་འདྲ་བར་མཛེས་པའོ་ཞེས་སྨྲའོ།
en: The flesh in between and above the right ear and the left ear of the foreheads of great persons is well shaped; the size of the forehead is fully completed and beautiful like a royal golden turban that has been bound on.

source: །སྔོན་གྱི་ལས་ཀྱང་དགེ་བའི་ལས་བྱེད་པ་ཐམས་ཅད་ཀྱི་ཐོག་མར་འགྲོ་བ་གཙོ་བོར་གྱུར་ནས་ཁོར་ཡུག་ཏུ་ཀུན་དགའ་ར་བ་དང་། འདུན་ཁང་དང་། བཏུང་བའི་གནས་ལ་སོགས་པ་བྱས་པ་སྟེ། དེའི་ཕྱིར་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པའོ། །གང་གི་ཕྱིར་ཚོགས་ཀྱི་གཙོ་བོར་གྱུར་ནས།
en: Again, the earlier karma is that they were “first”— they were chief “at doing” all wholesome actions, making “parks, assembly halls,” places to quench thirst and so on—therefore “they have a build like a fig tree,” and “an uṣṇīṣa on the top of their head,” because, having become chief in the assembly, they raised their head uncowed and fearlessly encouraged others to engage in these actions.

source: མ་ཞུམ་པར་མགོ་བསྟོད་དེ་འཇིག་པ་མེད་པར་སྦྱོར་བ་དེའི་ཕྱིར་དབུ་གཙུག་ཏོར་ཅན་དུ་གྱུར་ཏོ། །དེ་བས་ན་མངའ་དབང་ཆེན་པོ་མངའ་བའི་སྔ་ལྟས་ཞེས་བྱའོ།
en: Hence, “these are signs that presage holding the highest office.” “

source: །ལྗགས་རིང་ཞིང་སྲབ་པ་ཞེས་བྱ་བ་རིང་བ་ནི་ཆེ་བའམ་ཁྲུན་རིང་བའོ། །སྲབ་པ་ནི་མཉེན་པའོ།
en: A long thin tongue”: “long”—big or lengthy; “thin”—pliable. “

source: །ཚངས་པའི་དབྱངས་ཞེས་བྱ་བ་ནི་ཚངས་པའི་དབྱངས་དང་མཚུངས་པའམ། དབྱངས་མཆོག་ཡིན་པའི་ཕྱིར་ཏེ།
en: The voice of Brahmā”— because it is a voice like Brahmā, or the finest voice. “

source: བྱ་ཀ་ལ་པིང་ཀའི་གསུང་ཞེས་བྱ་བ་ནི་བྱ་ཀུ་ར་བའི་སྐད་ལྟ་བུའོ།
en: The call of the kalaviṅka bird”— like the sound of the Indian cuckoo. “

source: །ཟླ་བའི་དཀྱིལ་འཁོར་མ་ཉ་བ་ཚེས་བཅུ་གཉིས་ཀྱི་ཤས་འདྲ་བར་འགྲམ་པའི་མཐའ་ཤ་མཁྲེགས་ཤིང་ལེགས་པར་ཟླུམ་པའི་ཕྱིར་འགྲམ་པ་སེང་གེའི་ལྟ་བུའོ།
en: They have lion-like jaws” because they are similar in part to the moon on the twelfth day before it is full, and the edges of the jaws are muscled and excellently rounded. “

source: །སྐར་མ་པ་བ་སངས་པས་ཀྱང་ལྷག་པར་འོད་གསལ་ཞིང་དཀར་བའི་ཕྱིར་ཚེམས་ཤིན་ཏུ་དཀར་བའོ།
en: Very white teeth,” because they shine; “extremely white,” even more than the planet Venus. “

source: །མཐོན་དམན་དང་མི་མཉམ་པ་མེད་པའི་ཕྱིར་ཚེམས་མཉམ་པའོ།
en: Even teeth,” because they “are not too long or too short,” or uneven. “

source: །ཚེམས་ཀྱི་མཚམས་དོད་པ་ལ་སོགས་པ་མེད་ཅིང་སྡུག་པའི་ཕྱིར་ཚེམས་ཐགས་བཟང་བའོ།
en: Teeth without gaps”— because there are “no spaces between their teeth,” and so on, they are good looking. “

source: །མི་གཞན་དག་གི་སོ་ནི་སུམ་ཅུ་རྩ་གཉིས་སམ་ཉི་ཤུ་རྩ་བརྒྱད་ཡོད་ཀྱི། དེ་ལས་བཟློག་པ་ནི་གྲངས་བཞི་བཅུ་ཚང་བའི་ཕྱིར་ཚེམས་བཞི་བཅུ་མངའ་བའོ། །སྤྱན་མཐོན་མཐིང་ཞེས་བྱ་བ་ནི།
en: Forty teeth,” because while other humans have thirty-two or thirty-eight teeth, on the contrary their teeth number forty and are complete. “

source: སྤྱན་གྱི་དཀྱིལ་འཁོར་གྱི་ནང་གི་འབྲས་བུ་སྣུམ་ཞིང་གནག་པ་སྟེ།
en: Dark blue eyes”— the globe in the middle of the round of their eyes is moist and black.

source: འབྲས་བུ་ནག་པོའི་མཐའ་གཉིས་དཀར་ལ།
en: The two edges of the black globe are white.

source: རྫི་མ་གཉིས་གནས་པའི་སྐབས་སྣུམ་ཞིང་མཐིང་ཀར་འདུག་པ།
en: When the two eyelashes are still, they remain moist and dark blue.

source: གྲྭ་གཉིས་ཆུང་ཟད་དམར་བ།
en: The two corners are a little bit redder.

source: རྫི་མ་དང་སྤྱན་གྱི་བར་གསེར་གྱི་མདོག་ལྟ་བུ་སྟེ།
en: In between the eyelashes and eye is like a golden color.

source: དེ་ལྟར་དང་བ་རྣམ་པ་ལྔ་དང་ལྡན་དུ་ཟིན་གྱིས་ཀྱང་སྤྱན་གྱི་དཀྱིལ་གཙོ་བོ་ཡིན་པའི་ཕྱིར་སྤྱན་མཐོན་མཐིང་ཞེས་བྱའོ།
en: Thus, even though they do have the five clarities of sense faculties, still, because the circle of the eye is the foremost, it says “dark blue eyes.” “[

source: །བེའུ་འབྲངས་མ་ཐག་པ་གཞོན་ནུའི་རྫི་མ་དང་འདྲ་བར་རྫི་མ་བླ་འོག་གི་མདོག་ཤིན་ཏུ་སྣུམ་ཞིང་མ་འཛིངས་པའི་ཕྱིར་བའི་རྫི་མ་ལྟ་བུའོ།། །།བམ་པོ་ཉི་ཤུ་དྲུག་པ།
en: Their] eyelashes are like those of a cow,” because, like a calf that right from birth has a youth’s eyelashes, the color of “the upper and lower eyelashes” is extremely glossy, and they are “not entangled, so… [their] eyelashes are like those of a cow.” “

source: དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཞེས་བྱ་བ་ནི་མཚན་རྣམས་རྗེས་སུ་འབྱེད་པར་བྱེད་པའམ། མཚན་དང་རྗེས་སུ་མཐུན་པར་ཕྱེ་སྟེ། སྐྱེས་བུ་ཆེན་པོ་ཡིན་པར་སྟོན་པའམ། རྗེས་སུ་མཐུན་པར་མཛེས་པར་བྱེད་པའི་ཕྱིར་དཔེ་བྱད་བཟང་པོ་ཞེས་བྱའོ།
en: Eighty minor signs”— they are called “minor signs” because they subsequently expand on the major marks or are subsequently divided in conformity with the major marks, that is, they indicate that they are great persons or make them handsome in conformity with the major marks. “

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་སེན་མོ་ཟངས་ཀྱི་མདོག་ལྟ་བུ་ཡིན་ཞེས་བྱ་བས་དཔེ་བྱད་བཟང་པོ་བསྟན་ཏོ།
en: Lord buddhas have nails with a color like copper” is an explanation of a minor sign.

source: །འདུ་བྱེད་ཐམས་ཅད་ལས་དབེན་པ་ཞེས་བྱ་བ་ནི་དེའི་རྒྱུ་མཐུན་པ་སྟེ།
en: They “are isolated from all conditioned things” is its corresponding cause.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྙན་པར་སྨྲ་བས་སེམས་ཅན་རྣམས་སྡུད་དོ་ཞེས་བྱ་བ་ནི་ཚིག་སྙན་པ་རྣམས་ཀྱིས་བཙུད་ནས།
en: Bodhisattva great beings gather beings with those six perfections, by kind words.”

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་གིས་སྡུད་པར་བྱེད་པ་སྟེ། དེ་བས་ན་སྙན་པར་སྨྲ་བར་བགྲང་ངོ་།
en: Having brought them into the fold with kind words, they gather them into a retinue with the six perfections, so “kind words” is in the list. “

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་ཉིད་ཀྱིས་དོན་སྤྱད་པས་སེམས་ཅན་རྣམས་སྡུད་དོ་ཞེས་བྱ་བ་ནི་དོན་བྱ་བའི་བསམ་པས་དེ་སྔོན་དུ་བཏང་བས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་གིས་སྡུད་པ་སྟེ།
en: They have gathered beings… with those same six perfections by… beneficial actions.” The aspiration to do something of benefit goes ahead of the six perfections that gather them into a retinue.

source: དེ་བཞིན་དུ་ཕྱི་མ་རྣམས་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Connect the later ones like that as well. “

source: །ཡི་གེ་གཅིག་མངོན་པར་སྒྲུབ་པ་ལ་མཁས་པར་གྱིས་ཤིག་ཅེས་བྱ་བ་ནི་གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཕྱིར་ཨ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡི་གེའི་གཟུངས་ཀྱི་སྒོའི་རིམ་པས་ཡི་གེ་གཅིག་གིས་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་མངོན་པར་སྒྲུབ་པ་ལ་མཁས་པར་བྱ་བའོ།
en: Become skilled at one syllable accomplishment.” Through the sequence of dhāraṇī letters as gateways—“the letter a is the door to all dharmas because they are unproduced from the very beginning,” and so on—they should, through one letter, become skilled at the accomplishment of the signlessness meditative stabilization. “

source: །ཡི་གེ་གཅིག་གིས་ཐམས་ཅད་འགྲིབ་པ་དང་ལྡན་པར་རྗེས་སུ་གཏོགས་པར་གྱིས་ཤིག་ཅེས་བྱ་བ་ནི་འགྲིབ་པ་དང་ལྡན་པས་འགྲིབ་པ་དང་ལྡན་པ་སྟེ།
en: Know through one syllable that all have a decline.” To have a decline is to decline.

source: འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་འགྱུར་བ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means compounded phenomena have a complete change. “

source: །ཡི་གེ་གཅིག་ཏུ་ཡི་གེ་བཞི་བཅུ་རྩ་ལྔ་འདུས་པར་སྒོམས་ཤིག་ཅེས་བྱ་བ་ནི་སྐྱེ་བ་མེད་པའི་ཏིང་ངེ་འཛིན་སྒྲུབ་པ་ཨ་ཞེས་བྱ་བའི་ནང་དུ་ཡི་གེ་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་འདུས་པར་སྒོམས་ཤིག་ཅེས་བྱ་བའོ།
en: Meditate on forty-five syllables being included in one syllable.” Meditate on the meditative stabilizations of all the syllables being included in the a that accomplishes the nonproduction meditative stabilization. “

source: །ཡི་གེ་བཞི་བཅུ་རྩ་ལྔ་རྣམས་སུ་ཡི་གེ་གཅིག་འདུས་པར་སྒོམས་ཤིག་ཅེས་བྱ་བ་ནི་ཡི་གེ་བཞི་བཅུ་རྩ་ལྔའི་ཏིང་ངེ་འཛིན་ཨ་ཞེས་བྱ་བ་ཉིད་དུ་སྒོམས་ཤིག་ཅེས་བྱའོ།
en: Meditate on one syllable being included in forty-five syllables.”

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཡི་གེ་མེད་པའི་རྣམ་པས་སྤྲུལ་པའོ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་དབྱིངས་བརྗོད་དུ་མེད་པའི་རྣམ་པས་བསྐྱེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Meditate on the meditative stabilizations of the forty-five syllables being in just the a. “All dharmas, Subhūti, being the appearance of that for which there are no letters, are magical creations.” This means they are generated as an appearance of the inexpressible dharma-constituent.

source: །ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་གསོལ་ཏེ། གལ་ཏེ་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ་ལ་སྤྱོད་ན་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ་རྣམ་པར་མི་རྟོག་པའི་ཕྱིར་སེམས་ཅན་རྣམས་དང་། ཆོས་རྣམས་མི་དམིགས་ཏེ་མི་སྣང་ན་ཆོས་བཤད་པ་ཇི་ལྟར་འབྱུང་།
en: With “how do bodhisattva great beings practicing the perfection of wisdom arisen from maturation,” and so on, he is asking: If “a being… and a dharma… cannot be apprehended,” which is to say, do not appear when they practice what has arisen from maturation because what has arisen from maturation is an absence of conceptual thinking, how could they give an explanation of the Dharma?

source: ཡོད་པ་མ་ཡིན་པའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་སྦྱོར་ན་ཇི་ལྟར་ཕྱིན་ཅི་ལོག་ལ་སྦྱོར་བར་མི་འགྱུར་ཞེས་ཞུས་པའོ། །དེ་སྐད་ཞུས་པ་དང་།
en: How, given that they would be connecting them with dharmas on the side of awakening that do not exist, would they not “be connecting them with error?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་དེ་དེ་བཞིན་ནོ་དེ་དེ་བཞིན་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས་དེའི་ཚིག་ལ་མངོན་པར་དགྱེས་པར་མཛད་ནས།
en: Having asked that, the Lord said, “Exactly so, Subhūti, exactly so!” and so on, delighting in those words. “

source: དེ་ལྟར་ཆོས་དེ་དག་ཐམས་ཅད་སྟོང་པར་མཐོང་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་རབ་འབྱོར་སེམས་ཅན་དང་། ཆོས་རྣམས་སྟོང་པ་དེ་ནི་བདེན་མོད་ཀྱི། འོན་ཀྱང་དེ་དག་སྟོང་པ་ཉིད་དུ་སེམས་ཅན་རྣམས་ཀྱིས་མི་ཤེས་པས།
en: Having thus seen that all those dharmas are empty, teach the doctrine to beings,” and so on, teaches that although it is true that Subhūti, beings, and dharmas are empty, still beings do not know them as emptiness.

source: དེ་ཤེས་པར་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཆོས་སྟོན་ཏེ་ཆོས་སྟོན་པ་ན་ཡང་ཅི་ནས་ཀྱང་སྟོང་པ་ཉིད་དེ་འཁྲུག་པར་མི་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ་ཞེས་དེ་སྐད་བསྟན་པ་ཡིན་ནོ།
en: Hence the Lord teaches the doctrine in order that they will know, and when he teaches the doctrine, he teaches the doctrine so that one way or the other it does not disagree with that emptiness. “

source: །དེས་ཆོས་ཐམས་ཅད་སྒྲིབ་པ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་སྒྲིབ་པ་རྣམས་དང་བྲལ་ཤིང་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་མཐོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They see that all dharmas are without obscurations” means they see them separated from falsely imagined obscurations, as absolutely pure.

source: །དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པའི་དཔེ་ཡང་རྗེས་སུ་མཐུན་པར་ཟད་དོ།
en: The similarity based on the analogy of a tathāgata’s magical creation has been dealt with already. “

source: །མ་བཅིངས་མ་གྲོལ་བ་ཞེས་བྱ་བ་ནི་དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ན་ཆོས་ཉིད་ཀྱི་གཟུགས་ཀུན་བརྟགས་པས་རང་བཞིན་གྱིས་དབེན་པའི་ཕྱིར་མ་བཅིངས་པའོ། །དྲི་མ་མེད་པའི་གནས་སྐབས་ན་ཡང་གློ་བུར་གྱི་རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་མ་གྲོལ་བའོ།
en: By way of their not being bound and not being freed”— during the period when the true dharmic nature of form has stains it is a falsely imagined thing isolated from an intrinsic nature, so it is “not bound”; and even during the period when it is stainless there is no purification plucked out of thin air, so it is “not freed.” “

source: །གཟུགས་ཀྱི་མ་བཅིངས་མ་གྲོལ་བ་ཉིད་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་མ་བཅིངས་པ་ཉིད་དང་མ་གྲོལ་བ་ཉིད་ཅེས་བྱ་བ་ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ཡིན་ཏེ།
en: Form’s state of not being bound and not being freed is not form.” The “state of not being bound and not being freed” is the thoroughly established state.

source: དེ་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means it is not the intrinsic nature of a falsely imagined form. “

source: །ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ནི་རང་བཞིན་ཉིད་ཀྱིས་ཞེས་བྱ་བར་དགོངས་པའོ།
en: Are absolutely pure”— “in their basic nature” is intended. “

source: །དངོས་པོ་མེད་པ་ཡང་དངོས་པོ་མེད་པ་ལ་མི་གནས་སོ་ཞེས་བྱ་བ་ནི་མི་བརྟེན་པའི་ཕྱིར་ཏེ། དཔེར་ན་ནམ་མཁའ་ལ་ནམ་མཁའ་མི་གནས་པ་ལྟ་བུའོ།
en: Something nonexistent is not located in something nonexistent,” because it does not rest on it, just as, to illustrate, space is not located in space. “

source: །རང་གི་དངོས་པོ་ཡང་དངོས་པོ་མེད་པ་ལ་མི་གནས་ཏེ་མེད་པའི་ཕྱིར། དཔེར་ན་རི་བོང་གི་རྭ་ལ་སོགས་པ་རྣོ་བ་མི་གནས་པ་ལྟ་བུའོ།
en: Something’s own existence is not located in something nonexistent,” because it does not exist, just as, to illustrate, sharpness is not located in a rabbit’s horns and so on. “

source: །གཞན་དག་གི་དངོས་པོ་ཡང་དངོས་པོ་མེད་པའམ། རང་གི་དངོས་པོ་ལ་མི་གནས་ཏེ། གཞན་གྱི་དངོས་པོ་དང་རང་གི་དངོས་པོ་གཉིས་ཀ་ཡང་མེད་པའི་ཕྱིར་རོ།
en: And something else’s existence is not located in something nonexistent or in something’s own existence,” because both something else’s existence and something’s own existence are nonexistent.

source: །འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། ཉན་ཐོས་རྣམས་ཀྱིས་ཀྱང་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་འདི་ཉིད་རྟོགས་ཏེ་ཞེས་བྱ་བས་ནི་ཐམས་ཅད་ཀྱང་ཆོས་མངོན་པར་རྟོགས་པ་གཅིག་པ་ཉིད་དོ་ཞེས་སྟོན་ཏོ།
en: The lord buddhas, the bodhisattvas, pratyekabuddhas, worthy ones, and all the noble beings understand just that true dharmic nature of dharmas” teaches that all have just the one clear dharma realization. “

source: །ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་ལས་ཀྱང་མི་འདའོ་ཞེས་བྱ་བ་ནི་ཆོས་འཆད་པའི་ཚེ་དེ་དག་ལས་མི་འདའ་བའོ།
en: Without going beyond that true dharmic nature of dharmas”— when giving an exposition of the Dharma they do not go beyond that. “

source: །རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་ནི་འདའ་བ་མེད་དོ།
en: Subhūti, the dharma-constituent does not go beyond anything, and suchness and the very limit of reality do not go beyond anything either.”

source: །དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ནི་འདའ་བ་མེད་དོ་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་ནི་ཆོས་ཀྱི་སྐུ་སྟེ་འདའ་བ་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་འདའ་བ་མེད་དོ། །རང་སངས་རྒྱས་དང་། ཉན་ཐོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཐའ་ལ་འདའ་བ་མེད་དོ་ཞེས་བྱ་བར་བྱེ་བྲག་ཏུ་ཕྱེ་སྟེ་གཟུང་བར་བྱའོ།
en: Take them specifically with their particulars: the lord buddhas’ “dharma-constituent,” which is to say, dharma body, does not go beyond anything; the bodhisattvas’ “suchness” does not go beyond anything; and the śrāvakas’ and pratyekabuddhas’ “very limit of reality” does not go beyond anything. “

source: །འདི་ལྟར་དེ་དག་ལ་གང་འདའ་བར་འགྱུར་བའི་རང་བཞིན་མེད་དོ་ཞེས་བྱ་བ་ནི་འདའ་བར་བྱ་བའི་ངོ་བོ་ཉིད་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because they have no intrinsic nature that goes beyond anything” means an intrinsic nature that can be gone beyond does not exist. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཀྱི་དབྱིངས་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ལས་འདའ་བ་མ་མཆིས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་ཞུས་ཏེ། གཟུགས་དང་ཚོར་བ་ལ་སོགས་པ་ནི་རྣམ་པར་འགྱུར་བའི་ངོ་བོ་ཉིད་ཡིན་པས་འདའ་བར་སྣང་ན།
en: Lord, if, in the dharma-constituent, there is no going beyond, and in suchness and at the very limit of reality there is no going beyond,” and so on, poses the following question: Form, feeling, and so on are in their intrinsic nature changeable, so it appears they go beyond something.

source: འདི་ལྟར་གཟུགས་ལ་སོགས་པ་ལ་ནི་འདའ་བ་ཡོད་ཀྱི། ཆོས་ཀྱི་དབྱིངས་ལ་སོགས་པ་ལ་ནི་མེད་ན་དེའི་ཚེ་ཅི་གཟུགས་ལ་སོགས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་སོགས་པ་ལ་ཐ་དད་པ་ཡོད་དམ་ཞེས་ཞུས་པའོ།
en: Thus, there is a going beyond something when it comes to form and so on, but there is none when it comes to the dharma-constituent and so on, so, at that time are form and so on and the dharma-constituent and so on different? “

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པས་གཟུགས་དང་ཚོར་བ་ལ་སོགས་པའི་ཆོས་རྣམས་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་སོགས་པ་གསུམ་ཐ་དད་པ་མེད་པར་བསྟན་ཏོ།
en: No, Subhūti,” the Lord replied, and so on, teaches that the dharmas—form, feeling, and so on—and the three, the dharma-constituent and so on, are not different.

source: །དེའི་དགོངས་པ་ནི་འདི་ཡིན་ཏེ་དོན་དམ་པའི་གཟུགས་ལ་སོགས་པ་ལ་ནི་འདའ་བ་མེད་དོ་ཞེས་བྱ་བའོ།
en: The intention of this is that “ultimate form does not go beyond anything.”

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་གལ་ཏེ་གཟུགས་ཀྱང་གཞན་མ་ལགས། ཆོས་ཀྱི་དབྱིངས་ཀྱང་གཞན་མ་ལགས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་ཞུས་ཏེ། གལ་ཏེ་གཟུགས་དང་ཚོར་བ་ལ་སོགས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་སོགས་པ་ལ་ཐ་དད་པ་མེད་ན། འོ་ན་ནི་ཆོས་ཀྱི་དབྱིངས་ལ་སོགས་པ་བཞིན་དུ་ཆོས་ཐམས་ཅད་འདུས་མ་བྱས་པ་ཡིན་པའི་ཕྱིར་དགེ་བ་དང་མི་དགེ་བའི་ལས་རྣམས་ཀྱི་འབྲས་བུ་རྣམ་པར་དགོད་པ་མེད་པར་འགྱུར་རོ་ཞེས་ཞུས་པའོ།
en: Then the elder Subhūti said, “Lord, if form is not one thing and the dharma-constituent is not another,” and so on—he asks: if there is no difference between form, feeling, and so on, and the dharma-constituent and so on, well then, will there not be “a detailed presentation of the results” of wholesome and unwholesome actions because all dharmas will be uncompounded just as the dharma-constituent and so on are?

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ཉེ་བར་བཟུང་སྟེ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་གསུངས་ཏེ།
en: Then the Lord says, “Subhūti, … based on conventional truth,” and so on.

source: ཆོས་ཐམས་ཅད་འདུས་མ་བྱས་པའི་ངོ་བོ་ཉིད་ཡིན་དུ་ཟིན་ཀྱང་། འོན་ཀྱང་བྱིས་པ་ཀུན་བརྟགས་པའི་སྤྱོད་ཡུལ་དུ་བྱེད་པ་རྣམས་ལ། དགེ་བ་དང་མི་དགེ་བ་ཀུན་བརྟགས་པ་རྣམས་ཡོད་དེ། དེའི་དབང་གིས་རྣམ་པར་སྨིན་པ་དཀར་པོ་དང་ནག་པོ་ཡང་ཡོད་དོ།
en: This is saying that even though all phenomena are uncompounded in their intrinsic nature, nevertheless for “simple… folk,” who make them into falsely imagined objects, there are falsely imagined wholesome and unwholesome things, and through the force of that there are also bright and bad maturations.

source: །དེའི་དབང་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀུན་རྫོབ་ཀྱི་བདེན་པའི་ཚུལ་དུ་དེ་དག་བཤད་ཀྱི།
en: The Lord, governed by that, has given an exposition of them by way of their being “conventional truth.”

source: དོན་དམ་པར་ནི་ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཡིན་པས། ལས་དང་རྣམ་པར་སྨིན་པ་རྣམ་པར་དགོད་པ་བསྟན་པར་མི་ནུས་སོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པར་རྣམ་པར་མི་རྟོག་པའི་ཕྱིར་རོ། །ཆོས་དེ་ནི་རྣམ་པར་མི་རྟོག་པ་བརྗོད་དུ་མི་རུང་བས་བརྗོད་དུ་མེད་པ་སྟེ། འདི་ལྟར་མིང་དང་གཟུགས་ནི་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་།
en: Ultimately all dharmas are the intrinsic nature of suchness, so “an exposition of a detailed presentation of” karma and maturation is impossible because ultimately they “are undifferentiated”— those dharmas “are undifferentiated,” are not something that can be expressed, hence they are “not something that can be talked about,” and thus “name and form are not produced and do not stop, are not defiled and not purified.”

source: རྣམ་པར་བྱང་བ་མེད་པ་སྟེ་ཞེས་བྱ་བ་ནི་གཟུགས་མེད་པའི་ཆོས་རྣམས་དང་གཟུགས་ཀྱི་ཆོས་རྣམས་ཀྱི་ནང་ནས་མིང་ཞེས་བྱ་བ་དང་། གཟུགས་ཞེས་བྱ་བ་སྨོས་པ་ནི་ཀུན་རྫོབ་ཀྱི་བདེན་པའི་ཚུལ་ལོ།
en: From among the formless phenomena and form phenomena, saying “name” and “form” is conventional truth mode.

source: །དོན་དམ་པར་དེ་བཞིན་ཉིད་དེ་ནི་ཡོངས་སུ་གྲུབ་པ་ཡིན་པའི་ཕྱིར་རྣམ་པར་མི་རྟོག་པའོ།
en: Ultimately that suchness is thoroughly established and hence is undifferentiated.

source: །བརྗོད་དུ་མེད་པའི་ཕྱིར་བརྗོད་དུ་མི་རུང་བའོ།
en: It cannot be expressed, so it is “not something that can be talked about.”

source: །འདུས་མ་བྱས་པའི་ཕྱིར་སྐྱེ་བ་མེད་པའོ། །སྐྱེ་བ་མེད་པའི་ཕྱིར་འགག་པ་མེད་པའོ། །རང་བཞིན་གྱིས་དབེན་པའི་ཕྱིར་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའོ། །རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ཕྱིར་རྣམ་པར་བྱང་བ་མེད་པའོ།
en: It is uncompounded so it is “not produced”; it is not produced so it does “not stop”; it is isolated from an intrinsic nature so it is “not defiled”; and it is pure in its intrinsic nature so it is “not purified.” “

source: །འདི་ནི་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་།
en: They are an emptiness of what transcends limits and an emptiness of no beginning and no end.”

source: ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དོ་ཞེས་བྱ་བ་ནི་རྣམ་པར་མི་རྟོག་པ་ལ་སོགས་པ་དེ་དག་ཉིད་སྟོང་པ་ཉིད་རྣམ་པ་གཉིས་སུ་བརྗོད་དོ་ཞེས་བསྟན་པའོ།
en: Those same phenomena, undifferentiated and so on, are talked about as the two emptinesses.

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ཉེ་བར་བཟུང་སྟེ་འབྲས་བུ་རྣམ་པར་དགོད་པ་མཆིས་ཀྱི་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་ཞུས་ཏེ།
en: Subhūti said, “Lord, if the detailed presentation of results is based on conventional truth,” and so on.

source: གལ་ཏེ་ཡང་དག་པ་མ་ཡིན་པར་འབྲས་བུ་རྣམ་པར་དགོད་པར་བྱ་ན། བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ལ་སོགས་པ་ཡང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པར་ཅིའི་ཕྱིར་རྣམ་པར་མི་དགོད་ཅེས་བྱའོ།
en: He is asking: if you are going to make a presentation of results that are unreal why would you not make a presentation of “simple, ordinary folk,” and so on, “in the result of stream enterer,” and so on?

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། རབ་འབྱོར་ཅི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཀུན་རྫོབ་ཀྱི་བདེན་པའམ།
en: Then the Lord said, “Subhūti, were simple, ordinary folk to know the conventional truth or the ultimate truth,” and so on.

source: དོན་དམ་པའི་བདེན་པ་ཤེས་སམ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་བཀའ་སྩལ་ཏེ། འབྲས་བུ་རྣམ་པར་དགོད་པ་མེད་དུ་ཟིན་ཀྱང་ཀུན་བརྟགས་པ་རྣམས་ཡོངས་སུ་ཤེས་པ་ཉིད་ཀྱི་ཕྱིར་ཀུན་བརྟགས་པའི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པ་རྣམ་པར་དགོད་པ་ཡོད་དོ།
en: He is saying that while there is no detailed presentation of results, nevertheless there is a presentation of the falsely imagined result of stream enterer, and so on, because of the comprehension of falsely imagined things.

source: །བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ལ་ནི་དེ་ཡོངས་སུ་ཤེས་པ་མེད་དེ། དེའི་ཕྱིར་ལམ་སྒོམ་པ་ཡང་མེད་དོ།
en: Simple, ordinary folk do not comprehend, therefore they do not cultivate the path.
